#!/usr/bin/env perl
# coding: utf-8
#
#
#
#
# log4perl の例
#
#
#
#

use strict;
use Carp;
use Log::Log4perl;
use Time::HiRes;



###############################################################################
###############################################################################
###############################################################################
###############################################################################
###############################################################################
###############################################################################
package application;

our $_logger = undef;
sub get_logger {

	if(defined($_logger)) {
		return $_logger;
	}
	Log::Log4perl::init('conf/log4perl.conf');
	return Log::Log4perl->get_logger('myapp1');
}

sub subprocess {

	my $logger = application::get_logger();
	$logger->info('$$$ ○△□処理 開始 $$$');
	foreach (0..4) {
		$logger->debug('処理中...');
		Time::HiRes::sleep(rand(6));
	}
	$logger->info('--- ○△□処理 終了 ---');
}

sub run {

	my $logger = application::get_logger();

	$logger->info('### start ###');
	$logger->debug('デバッグメッセージ');
	$logger->info('情報');
	$logger->error('エラーメッセージ');

	application::subprocess();

	$logger->info('--- end ---');
}



###############################################################################
###############################################################################
###############################################################################
###############################################################################
###############################################################################
###############################################################################
package main;

sub _main {

	application::run();
}

END {

	if(defined($_logger)) {
		$_logger = undef;
	}
}

_main(@ARGV);

